In [1]:
import numpy as np
import pandas as pd

In [3]:
lables = ['a','b','c',]
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [6]:
pd.Series(data=my_list,index=lables)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(data=arr)

0    10
1    20
2    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(d,index=['c','e','f'])

c    30.0
e     NaN
f     NaN
dtype: float64

In [11]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])

In [14]:
  ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [16]:
ser2 = pd.Series([1,2,3,4],index = ['USA','Germany','Italy','japan'])

In [17]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      NaN
USA        2.0
USSR       NaN
japan      NaN
dtype: float64

In [18]:
1+np.NAN

nan

In [19]:
type(ser1)

pandas.core.series.Series

In [21]:
df = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
df.head()

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [24]:
df.tail(2)

          W         X         Y         Z
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [25]:
df['W']

A    0.190239
B   -0.654578
C    0.724914
D    0.216802
E    2.321924
Name: W, dtype: float64

In [26]:
type(df['W'])

pandas.core.series.Series

In [27]:
type(df['A'])

KeyError: 'A'

In [31]:
df[['W','Z']]

In [32]:
a = df[['W','Z']]
type(a)

pandas.core.frame.DataFrame

In [33]:
df.W

A    0.190239
B   -0.654578
C    0.724914
D    0.216802
E    2.321924
Name: W, dtype: float64

In [34]:
df['new']= df['W']+df['Y']

In [35]:
df

          W         X         Y         Z       new
A  0.190239  0.862865  0.292542 -0.261867  0.482782
B -0.654578 -1.020091  0.261182  0.400166 -0.393396
C  0.724914  1.003076 -1.260391  0.043282 -0.535477
D  0.216802 -0.702840  0.882873  0.456593  1.099675
E  2.321924  0.146989  0.638035  2.170390  2.959959

In [37]:
    df.drop('new',axis= 1)

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [39]:
df.drop('new',axis= 1,inplace=True)

In [40]:
df

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [41]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593

In [42]:
df

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [44]:
df.loc['A']

W    0.190239
X    0.862865
Y    0.292542
Z   -0.261867
Name: A, dtype: float64

In [46]:
df.iloc[2]

W    0.724914
X    1.003076
Y   -1.260391
Z    0.043282
Name: C, dtype: float64

In [47]:
df.loc['A','W']

0.1902393955766314

In [48]:
df.loc[['A','B'],['W','X']]

          W         X
A  0.190239  0.862865
B -0.654578 -1.020091

In [51]:
df.iloc[:2,:2]

          W         X
A  0.190239  0.862865
B -0.654578 -1.020091

In [53]:
df

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [52]:
df.iloc[3:,1:]

          X         Y         Z
D -0.702840  0.882873  0.456593
E  0.146989  0.638035  2.170390

In [58]:
df.iloc[:,[0,-2]]

          W         Y
A  0.190239  0.292542
B -0.654578  0.261182
C  0.724914 -1.260391
D  0.216802  0.882873
E  2.321924  0.638035

In [65]:
df.iloc[[2,4],[0,-2]]

          W         Y
C  0.724914 -1.260391
E  2.321924  0.638035

In [66]:
df>0

       W      X      Y      Z
A   True   True   True  False
B  False  False   True   True
C   True   True  False   True
D   True  False   True   True
E   True   True   True   True

In [67]:
df[df>0]

          W         X         Y         Z
A  0.190239  0.862865  0.292542       NaN
B       NaN       NaN  0.261182  0.400166
C  0.724914  1.003076       NaN  0.043282
D  0.216802       NaN  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [68]:
df[df['W']>0]

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [70]:
list1 = [1,2,3]
list1

[1, 2, 3]

In [71]:
type(list1)

list

In [73]:
arr1 = (1,2,3)
arr1

(1, 2, 3)

In [74]:
type(arr1)

tuple

In [75]:
np.array(list1)

array([1, 2, 3])

In [76]:
df[df['W']>0]['Y']

A    0.292542
C   -1.260391
D    0.882873
E    0.638035
Name: Y, dtype: float64

In [79]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.862865  0.292542
C  1.003076 -1.260391
D -0.702840  0.882873
E  0.146989  0.638035

In [83]:
df

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [84]:
df[(df['W']>0) & (df['Y']>0)]

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [85]:
df[(df['W']>0) | (df['Y']>0)]

          W         X         Y         Z
A  0.190239  0.862865  0.292542 -0.261867
B -0.654578 -1.020091  0.261182  0.400166
C  0.724914  1.003076 -1.260391  0.043282
D  0.216802 -0.702840  0.882873  0.456593
E  2.321924  0.146989  0.638035  2.170390

In [86]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.190239  0.862865  0.292542 -0.261867
1     B -0.654578 -1.020091  0.261182  0.400166
2     C  0.724914  1.003076 -1.260391  0.043282
3     D  0.216802 -0.702840  0.882873  0.456593
4     E  2.321924  0.146989  0.638035  2.170390

In [87]:
df['states']=['kar','maha','pun','del','guj']

In [88]:
df.set_index('states')

               W         X         Y         Z
states
kar     0.190239  0.862865  0.292542 -0.261867
maha   -0.654578 -1.020091  0.261182  0.400166
pun     0.724914  1.003076 -1.260391  0.043282
del     0.216802 -0.702840  0.882873  0.456593
guj     2.321924  0.146989  0.638035  2.170390

In [89]:
df.reset_index()

  index         W         X         Y         Z states
0     A  0.190239  0.862865  0.292542 -0.261867    kar
1     B -0.654578 -1.020091  0.261182  0.400166   maha
2     C  0.724914  1.003076 -1.260391  0.043282    pun
3     D  0.216802 -0.702840  0.882873  0.456593    del
4     E  2.321924  0.146989  0.638035  2.170390    guj

# missing data

In [90]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C': [1,2,3]})

In [91]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [93]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [94]:
df.dropna(how='all')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [95]:
df.dropna(how='any')

     A    B  C
0  1.0  5.0  1

In [96]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
#thresh deletes the rows which are having "non nan values" 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [99]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [101]:
df.fillna(value='prateek')

         A        B  C
0        1        5  1
1        2  prateek  2
2  prateek  prateek  3

In [102]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [104]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [105]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [107]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [109]:
df.groupby('A')
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [110]:
##groupby

In [111]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [113]:
df.max()

A    2.0
B    5.0
C    3.0
dtype: float64

In [114]:
df.describe()

              A    B    C
count  2.000000  1.0  3.0
mean   1.500000  5.0  2.0
std    0.707107  NaN  1.0
min    1.000000  5.0  1.0
25%    1.250000  5.0  1.5
50%    1.500000  5.0  2.0
75%    1.750000  5.0  2.5
max    2.000000  5.0  3.0

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [115]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [117]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [118]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [119]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [120]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [121]:
left
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [123]:
pd.merge(left,right,how='inner',on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2